Repository: Killerbee663/PaperLight
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ro

source: Please log in to access this page.
ro: Va rugam sa va autentificati pentru a accesa aceasta pagina.

source: Error: the translation service failed.
ro: Eroare: serviciul de traducere a eșuat.

source: [PaperLight] Reset Your Password
ro: [PaperLight] Resetati Parola

source: Username
ro: Nume de utilizator

source: Password
ro: Parola

source: Remember Me
ro: Retineti-ma

source: Sign In
ro: Autentificare

source: Repeat Password
ro: Repetati Parola

source: Register
ro: Inregistrare

source: Please use a different username.
ro: Va rugam sa folositi un alt nume de utilizator.

source: Please use a different email address.
ro: Va rugam sa folositi o alta adresa de email

source: Request Password Reset
ro: Solicitati Resetarea Parolei

source: Invalid username or password
ro: Nume de utilizator sau parola invalida

source: Congratulations, you are now a registered user!
ro: Felicitari, sunteti acum un utilizator inregistrat!

source: Reset Password
ro: Resetare Parola

source: Your password has been reset.
ro: Parola dumneavoastra a fost resetata.

source: About me
ro: Despre mine

source: Submit
ro: Trimite

source: Say something
ro: Spune ceva

source: Message
ro: Mesaj

source: Your post is now live!
ro: Postarea dumneavoastra este acum publicata!

source: Home
ro: Acasa

source: Explore
ro: Explorati

source: Your changes have been saved.
ro: Modificarile dumneavoastra au fost salvate.

source: Edit Profile
ro: Editati Profilul

source: User %(username)s not found.
ro: Utilizatorul %(username)s nu a fost gasit.

source: You cannot follow yourself!
ro: Nu va puteti urmari singur!

source: You are following %(username)s!
ro: Urmariti pe %(username)s!

source: You cannot unfollow yourself!
ro: Nu va puteti dezabona singur!

source: You are not following %(username)s.
ro: Nu urmariti pe %(username)s.

source: Send Message
ro: Trimite Mesaj

source: %(username)s said %(when)s
ro: %(username)s a spus %(when)s

source: Translate
ro: Traduceți

source: Welcome to PaperLight
ro: Bine ati venit pe PaperLight

source: Login
ro: Autentificare

source: Messages
ro: Mesaje

source: Profile
ro: Profil

source: Logout
ro: Deconectare

source: Hi, %(username)s!
ro: Buna, %(username)s!

source: Newer posts
ro: Postari mai noi

source: Older posts
ro: Postari mai vechi

source: Search Results
ro: Rezultate Căutare

source: Send Message to %(recipient)s
ro: Trimite mesaj către %(recipient)s

source: User
ro: Utilizator

source: Last seen on
ro: Vazut ultima data pe

source: %(count)d followers
ro: %(count)d urmaritori

source: %(count)d following
ro: %(count)d urmăreste

source: Edit your profile
ro: Editati-va profilul

source: Follow
ro: Urmariti

source: Unfollow
ro: Nu mai urmariti

source: Send private message
ro: Trimite mesaj privat

source: New User?
ro: Utilizator nou?

source: Click to Register!
ro: Click pentru Inregistrare!

source: Forgot Your Password?
ro: Ati uitat Parola?

source: Click to Reset It
ro: Click pentru a o Reseta

source: Reset Your Password
ro: Resetati Parola

source: Not Found
ro: Nu a fost gasit

source: Back
ro: Inapoi

source: An unexpected error has occurred
ro: A aparut o eroare neasteptata

source: The administrator has been notified. Sorry for the inconvenience!
ro: Administratorul a fost notificat. Ne cerem scuze pentru neplaceri!
